SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( MT_DD_CLASS_27_27102
Comment ( Model, textures and supporting files are copyright Making Tracks Rail Simulations Software 2008 )
 Comment ( File lasted edited by DD 21/07/2008 )
 Type ( Engine )
 WagonShape ( MT_DD_CLASS_27_27102.s )
 Size  ( 2.607828m 3.78143m 15.67289m )
 CentreOfGravity ( 0m 1.890715m 0m )
 Mass ( 75t )
 WheelRadius ( 0.546m )
 InertiaTensor ( Box ( 2.591983m 3.735878m 17.3684m ) )

 Coupling (
 Type ( Automatic )
 Spring(
 Stiffness ( 1e6N/m 5e6N/m )
 Damping ( 1e6N/m/s 1e6N/m/s )
 Break ( 1.8e7N 1.8e7N )
 r0 (20cm 30cm)
 )
 comment( CouplingHasRigidConnection () )
 Velocity ( 0.1m/s )
 )
 Buffers (
 Spring (
 Stiffness ( 1e6N/m 5e6N/m )
 Damping ( 1e6N/m/s 1e6N/m/s )
 r0 ( 0m 1e9 )
 )
 Centre ( 0.5 )
 Radius ( 1 )
 Angle ( 0.5deg )
 )
 
 Adheasion ( 0.1 0.5 0.43 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 2.5*107t )
 DerailBufferForce ( 500kN )
 NumWheels ( 6 )
 Friction (
 1459N/m/s 0 1mph 11.54N/m/s 1.8
 5.1N/rad/s 1 -1rad/s 0 1
 )
 

         BrakeEquipmentType ( "Triple_valve, Auxilary_reservoir, Emergency_brake_reservoir" )

        BrakeSystemType ( "Air_single_pipe" )
        MaxBrakeForce( 343kN )

        EmergencyBrakeResMaxPressure( 110 )
        TripleValveRatio( 2.5 )
        MaxReleaseRate( 40 )
        MaxApplicationRate( 40 )
        MaxAuxilaryChargingRate( 35 )
        EmergencyResCapacity( 10 )
        EmergencyResChargingRate( 30 )
        BrakeCylinderPressureForMaxBrakeBrakeForce( 70 )


 


 IntakePoint ( 0.0 0.4 FuelDiesel )
 IntakePoint ( -0.0 0.4 FuelDiesel )

 Lights ( 9
  
 Comment ( Headlight copied from HST by Chris Jakeman 24-8-2014 )
       Light   (
         comment( Hi-intensity light HIGH beam )
         Type      ( 1 )
         Conditions   (
            Headlight ( 3 )
            Unit ( 2 )
            )
         Cycle   ( 0 )
         FadeIn   ( 0.5 )
         FadeOut   ( 0.5 )
         States   (   1
            State   (
               Duration ( 0.0 )
               LightColour ( ffffcb8d )
               Position ( 0 2.34 8.66 )
               Transition ( 0 )
               Radius ( 150 )
               Angle ( 10.0 )
               )
            )
         )
		 
 comment ( *** forward lights *** )
 
 Light (
 comment( marker left forward )
 Type ( 0 )
 Conditions (
 Headlight ( 4 )
 Unit ( 2 )
 )
 FadeIn ( 0.2 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 90ffcc60 )
 Position ( 0.31 3.59 7.1359 )
 Azimuth ( 0.0 -0.0 0.0 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )
 Light (
 comment( marker right forward  )
 Type ( 0 )
 Conditions (
 Headlight ( 4 )
 Unit ( 2 )
 )
 FadeIn ( 0.2 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 90ffcc60 )
 Position ( -0.31 3.59 7.1359 )
 Azimuth ( 0.0 -0.0 0.0 )
 Transition ( 0 )
 Radius ( 0.3 )
 )
 )
 )
 Light (
 comment( Rear left red forward )
 Type ( 0 )
 Conditions (
 Headlight ( 4 )
 Unit ( 3 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( 0.9374 1.5208 -7.2793 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 0.2 )
 )
 )
 )

 Light (
 comment( Rear right red forward )
 Type ( 0 )
 Conditions (
 Headlight ( 4 )
 Unit ( 3 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( -0.9374 1.5208 -7.2793 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 0.2 )
 )
 )
 )


comment ( ** Reverse Lights ** )


 
 Light (
 comment( marker left reverse )
 Type ( 0 )
 Conditions (
 Headlight ( 4 )
 Unit ( 5 )
 )
 FadeIn ( 0.2 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 90ffcc60 )
 Position ( -0.31 3.59 -7.1359 )
 Azimuth ( 0.0 -0.0 0.0 )
 Transition ( 0 )
 Radius ( 0.3 )
 Azimuth ( -180 -180 -180 )
 )
 )
 )
 Light (
 comment( marker right forward  )
 Type ( 0 )
 Conditions (
 Headlight ( 4 )
 Unit ( 5 )
 )
 FadeIn ( 0.2 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 90ffcc60 )
 Position ( 0.31 3.59 -7.1359 )
 Azimuth ( 0.0 -0.0 0.0 )
 Transition ( 0 )
 Radius ( 0.3 )
 Azimuth ( -180 -180 -180 )
 )
 )
 )
 Light (
 comment( Rear left red reverse )
 Type ( 0 )
 Conditions (
 Headlight ( 4 )
 Unit ( 4 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( -0.9374 1.5208 7.2793 )
 Transition ( 0 )
 Radius ( 0.2 )
 )
 )
 )

 Light (
 comment( Rear right red reverse )
 Type ( 0 )
 Conditions (
 Headlight ( 4 )
 Unit ( 4 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80dd1520 )
 Position ( 0.9374 1.5208 7.2793 )
 Transition ( 0 )
 Radius ( 0.2 )
 )
 )
 )

 )


   Sound ( "../../MT_Common.sound/ELR/class26/class27eng.sms" )
 )

Engine ( MT_DD_CLASS_27_27102
 Effects
 (
 DieselSpecialEffects
 (
 comment
 (
 the format of these little blocks is as follow:

 offset.x offset.y offset.z
 normal.x normal.y normal.z
 width in metres

 defining the offset from the shape pivot point
 where steam / smoke should appear, the direction
 it should go and the width of the nozzle
 )

 Exhaust1
 (
 -0.5435 3.818 1.35
 0.25 1 0
 0.3
 )
 )
 )
 
 Wagon ( MT_DD_CLASS_27_27102 )
 Type ( Diesel )
 MaxPower ( 933hp )
 MaxForce ( 177.929kN ) 
 MaxContinuousForce ( 111.206kN )
 MaxVelocity ( 90mph )
 MaxCurrent ( 2000A ) 
 WheelRadius ( 21.5in )
 comment( sanding system is switched off when faster than given velocity )
 Sanding ( 1e9mph )

 NumWheels ( 1.5 )
 MaxTemperature ( 120 )
 MaxOilPressure ( 90 )

 CabView ( ..\\..\\MT_Common.cabs\\HP\\Class26\\Class26.cvf )
 HeadOut ( -1.45 2.85 6.3 )
 MaxDieselLevel ( 500gal )
 DieselUsedPerHourAtMaxPower ( 93gal )
 DieselUsedPerHourAtIdle ( 6.4gal )
 
 
        AirBrakesAirCompressorPowerRating( 1.7 )
        AirBrakesMainMinResAirPressure( 0 )
        AirBrakesMainMaxAirPressure( 130 )
        AirBrakesMainResVolume( 8 )
        AirBrakesAirCompressorWattage( 19000 )
        AirBrakesCompressorRestartPressure( 125 )
        AirBrakesAirUsedPerPoundsOfBrakePipePressure( 0.27 )
        AirBrakesHasLowPressureTest( 1 )
        AirBrakesIsCompressorElectricOrMechanical( 1 )

        EngineBrakesControllerMinPressureReduction( 6 )
        TrainBrakesControllerMinPressureReduction( 6 )
        EngineBrakesControllerHasProportionalBrake( 1 )
        EngineBrakesProportionalBrakeLag( 0.9 )
        EngineBrakesControllerMaxApplicationRate( 20 )
        TrainBrakesControllerMaxApplicationRate( 10 )
        EngineBrakesControllerMaxReleaseRate( 20 )
        TrainBrakesControllerMaxReleaseRate( 4 )
        EngineBrakesControllerEmergencyApplicationRate( 50 )
        TrainBrakesControllerEmergencyApplicationRate( 50 )
        EngineBrakesControllerMinSystemPressure( 0 )
        TrainBrakesControllerMinSystemPressure( 0 )
        EngineBrakesControllerMaxSystemPressure( 90 )
        TrainBrakesControllerMaxSystemPressure( 90 )
        EngineBrakesControllerEmergencyBrakeTimePenalty( 0 )
        TrainBrakesControllerEmergencyBrakeTimePenalty( 0 )
        EngineBrakesControllerFullServicePressureDrop( 26 )
        TrainBrakesControllerFullServicePressureDrop( 26 )

        DynamicBrakesMinUsableSpeed( 5 )
        DynamicBrakesMaximumEffectiveSpeed( 25 )
        DynamicBrakesMaximumForce( 100kN )
        DynamicBrakesResistorCurrentLimit ( 700 )
        DynamicBrakesCutInSpeed( 8 )
        DynamicBrakesMaxAirBrakePressure ( 15 )
        DynamicBrakesFadingSpeed( 25 )
        DynamicBrakesDelayTimeBeforeEngaging ( 10 )
        DynamicBrakesMaximumSpeedForFadeOut ( 65 )
        DynamicBrakesEffectAtMaximumFadeOut( 0 )
        DynamicBrakesHigherSpeedCurveExponent( 1 )
        DynamicBrakesLowerSpeedCurveExponent( 1 )
        DynamicBrakesNumberOfControllerNotches( 8 )
        DynamicBrakeHasAutoBailOff( 1 )

        BrakesEngineBrakeType ( "Air_single_pipe"  )
        BrakesTrainBrakeType ( "Air_single_pipe" )
        BrakesEngineControllers( "Independent, Train, Dynamic" )


 
 EngineBrakesControllerDirectControlExponent( 1 )

 MaxDieselLevel ( 500gal )

 (* Excessive smoke in ORTS so reduced values to 1/4.
 DieselSmokeEffectInitialMagnitude( 1.0 )
 DieselSmokeEffectMaxMagnitude( 4.0 )
 DieselSmokeEffectInitialSmokeRate( 1.6 )
 DieselSmokeEffectMaxSmokeRate( 8.0 ) 
 *)
 DieselSmokeEffectInitialMagnitude( 0.25 )
 DieselSmokeEffectMaxMagnitude( 1.0 )
 DieselSmokeEffectInitialSmokeRate( 0.4 )
 DieselSmokeEffectMaxSmokeRate( 2.0 )
 
 DieselEngineIdleRPM( 400 )
 DieselEngineMaxRPM( 750 )
 DieselEngineSpeedOfMaxTractiveEffort( 14mph ) 
 DieselEngineMaxRPMChangeRate( 200 )

 DoesHornTriggerBell( 0 )

 EmergencyStopMonitor(
 MonitoringDeviceMonitorTimeLimit( 0 )
 MonitoringDeviceAlarmTimeLimit( 0 )
 MonitoringDevicePenaltyTimeLimit( 0 )
 MonitoringDeviceCriticalLevel( 0 )
 MonitoringDeviceResetLevel( 0 )
 MonitoringDeviceAppliesFullBrake( 0 )
 MonitoringDeviceAppliesEmergencyBrake( 1 )zzz
 MonitoringDeviceAppliesCutsPower( 0 )
 MonitoringDeviceAppliesShutsDownEngine( 0 )
 )

 Comment ( AWS not working so Vigilance Monitor copied from HST by Chris Jakeman 24-8-2014 )

  VigilanceMonitor(
  MonitoringDeviceMonitorTimeLimit( 25 )
  MonitoringDeviceAlarmTimeLimit( 17 )
  MonitoringDevicePenaltyTimeLimit( 0 )
  MonitoringDeviceCriticalLevel( 0 )
  MonitoringDeviceResetLevel( 0 )
  MonitoringDeviceAppliesFullBrake( 1 )
  MonitoringDeviceAppliesEmergencyBrake( 0 )
  MonitoringDeviceAppliesCutsPower( 0 )
  MonitoringDeviceAppliesShutsDownEngine( 0 )
  )
  
 AWSMonitor(
 MonitoringDeviceMonitorTimeLimit( -1 )
 MonitoringDeviceAlarmTimeLimit( 5 )
 MonitoringDevicePenaltyTimeLimit( 0 )
 MonitoringDeviceCriticalLevel( 0 )
 MonitoringDeviceResetLevel( 0 )
 MonitoringDeviceAppliesFullBrake( 0 )
 MonitoringDeviceAppliesEmergencyBrake( 1 )
 MonitoringDeviceAppliesCutsPower( 0 )
 MonitoringDeviceAppliesShutsDownEngine( 0 )
 )
 
 EngineVariables( 3600 )
 
 
        EngineControllers (
            Throttle ( 0 1 0.125 0 0.
                NumNotches ( 9
                    Notch ( 0       0 Dummy )
                    Notch ( 0.125   0 Dummy )
                    Notch ( 0.25    0 Dummy )
                    Notch ( 0.375   0 Dummy )
                    Notch ( 0.5     0 Dummy )
                    Notch ( 0.625   0 Dummy )
                    Notch ( 0.75    0 Dummy )
                    Notch ( 0.875   0 Dummy )
                    Notch ( 1       0 Dummy )
                )
            )
            Brake_Engine ( 0 1 0.0125 0
                NumNotches ( 1
                    Notch( 0  1 Dummy )
                )
            )
            Brake_Train ( 0 1 0.0125 0.75
                NumNotches ( 4
                    Notch( 0    0 TrainBrakesControllerReleaseStart )
                    Notch( 0.15  1 TrainBrakesControllerGraduatedSelfLapLimitedHoldingStart )
                    Notch( 0.65 0 TrainBrakesControllerSuppressionStart )
                    Notch( 0.8  0 TrainBrakesControllerContinuousServiceStart )



                )
            )
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            AWS ( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            Wipers ( 0 1 0 )
            EmergencyStopResetToggle( 0 1 0 )
            EmergencyStopToggle( 0 1 0 )
            Vigilance ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
            BailOffButton( 0 1 0 )
        )




 
   Sound ( "../../MT_Common.sound/ELR/class26/class27cab.sms" )
 Name ("MT Class 27 27102 BR Blue")
 Description (
 "Type 2 Bo-Bo Class 27 diesel-electric locomotive\n\n"+
 "Built by BRCW 1961-1962\n\n"+
 "Numbers: 27001 to 27069\n\n"+
 "Locomotive type: Diesel-Electric\n\n"+
 "Power source: Diesel engine Sulzer 6LDA28A 6cyl\n\n"+
 "Power: 1,250 hp @ 750rpm \n\n"+
 "Power at Rail: 933 hp \n\n"+
 "Maximum speed: 90 mph \n\n"+
 "Route Availability: 5 \n\n"+
 "Coupling Code: Blue Star\n\n"+
 "Brake Force: 35ton, Type: Vacuum/Air\n\n"+
 "Generator: GEC WT981\n\n"+
 "Traction motors: 4 GEC WT459, axle-hung\n\n"+
 "Maximum tractive effort: 40,000lbf \n\n"+
 "Continuous tractive effort: 25,000lbf\n\n"+
 "Wheel configuration: Bo-Bo\n\n"+
 "Weight: 74-77 tonnes \n\n"+
 "Height: 12 ft. 8 in.\n\n"+
 "Length: 50 ft. 9 in.\n\n"+
 "Width: 8 ft. 10 in."

 )
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key to move the Reverser to Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
 "4. Press the D key to move the throttle from Idle. DO NOT EXCEED 1500 Amps on Ammeter\n"+ 
 "5. Gradually increase power (D key) until your train reaches the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to close the throttle.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+ 
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
 "To bail off the train brakes on the locomotive\n"+
 "1. Press the / (FORWARD SLASH) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
 "To apply the locomotive brake\n"+
 "1. Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
 "To release the locomotive brake\n"+
 "1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
 "To activate emergency braking\n"+
 "1. Press the A key to reduce the throttle to Idle.\n"+
 "2. Press the BACKSPACE key to activate emergency braking.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key to move the Reverser to the Reverse position.\n"+
 "4. Release the brakes.\n"+
 "5. Slowly advance the throttle lever (D key).\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window." ) 
)

